[
  {
    "name": "Ms Euleen Goh",
    "subtitle": "<span>Chairman</span><br><span class='smaller'>(from 16 May 2018)</span>",
    "image": "../images/governing-euleen-goh.jpg",
    "content": "<p><strong>Chairman</strong><br>SIM Governing Council<br><span class='smaller'>(from 16 May 2018)</span></p><p><strong>Non-Executive Chairman</strong><br>SATS Ltd</p><p>Ms Euleen Goh is Non-Executive Chairman of SATS Ltd, a leading provider of food solutions and gateway services.</p><p>She is also a Non-Executive Board Member of Royal Dutch Shell plc, CapitaLand Limited, DBS Group Holdings Ltd, DBS Bank Ltd, Singapore Health Services Pte Ltd and a Trustee of Temasek Trust and the Singapore Institute of International Affairs Endowment Fund. She also chairs the Board of Governors of NorthLight School as well as the Board of Directors of DBS Foundation Ltd.</p><p>Ms Goh is the Rector of Cinnamon College, National University of Singapore. This is a non-executive role, working with the College Master to set strategic directions for the college.</p><p>A Chartered Accountant from the Institute of Chartered Accountants in England and Wales, she holds further professional qualifications in banking and taxation. Ms Goh is also a Fellow of the Singapore Institute of Chartered Accountants and the Singapore Institute of Directors.</p><p>Ms Goh held various senior management positions in Standard Chartered Bank, travelling widely throughout the Group’s operations in the course of her duties. Following her retirement, she has held non-executive appointments on various Boards including Singapore Airlines Limited, Aviva plc, Singapore Exchange Limited, MediaCorp Pte Ltd, Standard Chartered Bank Thai pcl and Standard Chartered Bank Malaysia Berhad. She is the former Chairman of Singapore International Foundation, International Enterprise Singapore and Accounting Standards Council, Singapore as well as a former Member of the Management Advisory Board of the NUS Business School. </p><p>Ms Goh was named as Her World Woman of the Year 2005. She was awarded a Public Service Medal in that same year and a Public Service Star in 2012.</p>"
  },
  {
    "name": "Mr Tan Soo Jin",
    "subtitle": "<span>Chairman</span><br><span class='smaller'>(until 16 May 2018)</span>",
    "image": "../images/governing-tan-soo-jin.jpg",
    "content": "<p><strong>Chairman and Member</strong><br>SIM Governing Council<br><span class='smaller'>(Mr Tan Soo Jin was Chairman and Member of SIM Governing Council until 16 May 2018)</span></p><p><strong>Advisor</strong><br>Gattie-Tan Soo Jin Management Consultants Pte Ltd</p><p>Mr Tan Soo Jin, BEc (Monash) MBA (UNSW), is the Advisor of Gattie-Tan Soo Jin Management Consultants Pte Ltd (GTSJ) for leadership consulting. He founded Tan Soo Jin Consultants in Singapore in 1984 which later became GTSJ in 1992, having previously been with Egon Zehnder, Korn Ferry and Amrop. He also worked with Smith & Nephew, University of Singapore and Shell Australia.</p><p>Mr Tan has been in executive search since 1977 with particular expertise in the financial services, consumer and retail, and education sectors.</p><p>He was the Chairman of SIM Governing Council as well as Singapore Institute of Management Holdings Pte Ltd Board of Directors for the terms 2014-2018.</p><p>He is a Member of the NUS Business School Management Advisory Board and in 2012, he was appointed and is currently serving as an Executive-In-Residence with the NUS Business School. He formerly sat on the National Library Board, chairing its Ethics and Establishment Committees. He was also formerly on the Temasek Polytechnic Business Advisory Committee and a former Member of the Centre for Innovation and Enterprise's Advisory Panel at Republic Polytechnic.</p><p>He was named in Bloomberg BusinessWeek’s 100 Most Influential Headhunters in the world in 2008.</p>"
  },
  {
    "name": "Professor Hsieh Tsun-yan",
    "image": "../images/governing-hsieh-tsun-yan.jpg",
    "content": "<p><strong>Vice-Chairman</strong><br> SIM Governing Council</p><p><strong>Secretary </strong><br>SIM Governing Council<br><span class='smaller'>(from 16 May 2018)</span></p><p><strong>Chairman and Lead Counsellor</strong><br>LinHart Group</p><p>Professor Hsieh Tsun-yan is the Chairman and Lead Counsellor of LinHart Group, a leadership services firm specialising in advising boards and counselling CEOs globally on succession and top leadership effectiveness. He is an Independent Director of Manulife Financial and Singapore Airlines and served on the Boards of Bharti Airtel and Sony. He is also a Provost Chair Professor (Practice) at the NUS Business School and the Lee Kuan Yew School of Public Policy. He also serves as a special advisor to companies such as Cue Ball (media and technologies) and AppDirect (cloud services).</p><p>In a career spanning 30 years with McKinsey, he took on leadership positions including Chairman of Professional Development Committee, Managing Director, Canada and ASEAN practices, Chairman of Asia Client Committee, Global leader of the Organisation and Leadership practice, and the Directors Committee.</p><p>His community service includes Board roles current and past with the Duke-NUS Medical School, the Singapore International Foundation, the National University of Singapore Business School, the Institute of Policy Studies, the Singapore Symphony Orchestra, Covenant House Canada and the University Health Network Foundation in Toronto.</p><p>Professor Hsieh is a Harvard MBA who won double gold medals reading Mechanical Engineering at the University of Alberta as a President and Colombo Plan Scholar.</p>"
  },
  {
    "name": "Mr Patrick Fang",
    "image": "../images/governing-patrick-fang.jpg",
    "content": "<p><strong>Secretary </strong><br>SIM Governing Council<br><span class='smaller'>(until 16 May 2018)</span></p><p><strong>Managing Director</strong><br>PFang & Associates Pte Ltd</p><p>Mr Patrick Fang is currently the Managing Director of PFang & Associates Pte Ltd and he focuses on senior executive searches and assessment assignments for both privately and publicly listed firms including local conglomerates in Singapore and the Asian region. Mr Fang has specific expertise in the technology, industrial and financial services (insurance) sectors.</p><p>Prior to PFang & Associates, Mr Fang spent 16 years with Russell Reynolds Associates where he has held roles as the Managing Director and co-Office Manager for Singapore. He was also a leader in the technology and digital transformation practice, and has worked closely with telecommunications and financial services clients.</p><p>Mr Fang was previously with IMPAC, a US-based management consulting firm, where he held the position of Vice President, Operations, with responsibilities for multiple global regions. He also spent eight years with Motorola overseeing its multimedia and wireless data product activities.</p><p>He received his Bachelor of Science (Honours) in Mechanical Engineering from Plymouth University and Master of Arts (Distinction) in Business Analysis from the University of Lancaster.</p>"
  },
  {
    "name": "Mr Jen Kwong Hwa",
    "image": "../images/governing-jen-kwong-hwa.jpg",
    "content": "<p><strong>Treasurer </strong><br>SIM Governing Council<br><span class='smaller'>(until 16 May 2018)</span></p><p><strong>Chairman</strong><br>GridComm Pte Ltd</p><p>Mr Jen Kwong Hwa is Chairman at GridComm Pte Ltd. </p><p>Prior to this, he was Managing Director of Micron Semiconductors in Singapore and an engineer by training. He started his career in Texas Instruments in 1979 and joined Micron in 1998 with Micron's acquisition of Texas Instruments’ memory business. </p><p>Mr Jen has extensive experience in the semiconductor industry and has been involved in shaping national strategic initiatives through his involvement in SEMI, SSIA and membership in various statutory boards like Energy Market Authority, Jurong Town Council and Economic Strategies Committee. </p><p>He is currently a Board Member of LIME Learning Systems Pte Ltd and Connected Health.</p>"
  },
  {
    "name": "Ms Madeleine Lee",
    "image": "../images/governing-madeleine-lee.jpg",
    "content": "<p><strong>Treasurer </strong><br>SIM Governing Council<br><span class='smaller'>(from 16 May 2018)</span></p><p><strong>Managing Director/Chief Investment Officer</strong><br>Athenaeum Pte Ltd</p><p>Ms Madeleine Lee is the Managing Director/Chief Investment Officer of Athenaeum Pte Ltd, established to provide tailor-made investment advice with an Asian focus to family offices and endowments. She has over 30 years of experience in investment management and has worked in GIC, and Chase and Morgan Grenfell (now Deutsche Asset Management). </p><p>She was formerly the Managing Director/Chief Investment Officer of Commerzbank Asset Management Asia in 1997 and Deputy Chief Investment Officer of NUS Endowment Fund from 2005 to 2007. She won Fund of the Year Award in BT-Micropal Funds Award 1996 and has been consistently one of the top performing managers in Singapore. She co-founded bowtieAsia in 2000, specialising in private equity investments and incubation in infocomm and biotech and received the inaugural Montblanc Businesswomen Award in 2001. </p><p>Ms Lee has served on the Boards of Arts House Limited, Mapletree Investments, AETOS Security Pte Ltd, ECICS Holdings, Investment Committees of IDA/IMDA, Singapore Academy of Law, The Community Foundation, NVPC, Yong Siew Toh Conservatory of Music, NUS; the Development Committee of SSO and Advisory Board of theatre company WildRice. </p>   "
  },
  {
    "name": "Ms Susan Chong",
    "image": "../images/governing-susan-chong.jpg",
    "content": "<p><strong>Chief Executive Officer</strong><br>Greenpac (S) Pte Ltd<p>Ms Susan Chong is the CEO of Greenpac (S) Pte Ltd, a knowledge-based company that specialises in re-engineering, designing and distributing innovative, environmentally friendly packaging products and solutions. Since starting the company in September 2002, Susan grew Greenpac from a one-woman start-up into a thriving multimillion dollar company. In the current environment where companies are more aware of the need to reduce their carbon footprint to achieve a sustainable future, Greenpac’s customised solutions help companies switch to environmentally friendly packaging while reducing wastage and increasing their cost savings. Today, Greenpac serves Fortune 500 companies and is the market leader for environmentally friendly packaging solutions in Asia.<p>As a recognition of its contributions to innovation and environmental sustainability, Greenpac was given the Singapore Quality Award by SPRING Singapore in 2014. Greenpac was ranked 4th in the Singapore Enterprise 50 Awards in 2008 and also won the WorldStar Packaging Award consecutively since 2009.<p>Susan was awarded the EY Entrepreneur of the Year by Ernst & Young Singapore in 2014. She was also conferred the Senior Alumni Award by National University of Singapore Business School in 2016 and is an alumnus of Harvard Business School."
  },
  {
    "name": "Ms Junie Foo",
    "image": "../images/governing-junie-foo.jpg",
    "content": "<p><strong>Group Executive Director</strong><br>Methodist Welfare Services</p><p>Ms Junie Foo has close to 30 years of banking and finance experience, having worked at Citibank, Standard Chartered Bank and MUFG where she was the first non-Japanese, female in management for the corporate banking division for Asia Oceania.</p><p>Since her days as the President of the Financial Women’s Association, Singapore, Junie has been a champion for women and she is passionate about facilitating opportunities for women to advance into senior leadership roles. She is a strong advocate for diversity within organisations and believes it to be both a recipe for business success, as well as a socially responsible measure. She is the Founding Chair of BoardAgender, an initiative to create awareness on the economic benefits of having more women on boards and the necessity of harnessing human capital through building a solid pipeline of senior women in leadership positions. She was a former Treasurer on the SCWO Board and frequently speaks and facilitates discussions on women in leadership, board diversity and corporate governance.</p><p>She is a Fellow of the Singapore Institute of Directors (SID) and chairs the Board Appointment and Diversity Committee on the SID council. She is also on the Faculty Advisory Board, National University of Singapore, Faculty of Arts and Social Sciences. </p>"
  },
  {
    "name": "Mr Tan Choon Seng",
    "image": "../images/governing-tan-choon-seng.jpg",
    "content": "<p><strong>Chairman</strong><br>Truscott Group</p><p>Mr Tan Choon Seng is Chairman of Truscott Group, a private investment company. He is an active angel investor and has co-founded Indiverein, Link2ventures and Aleko Investment Pte Ltd.</p><p>He holds directorships in Fundedbyme Sweden, Fundedbyme Asia Pacific Ltd and Noa Potions AB, Sweden. He is a Director of Kuangchen Pte Ltd, Sparrow Capital Pte Ltd and Nihon Connexion Pte Ltd.</p><p>He was formerly the Group Chief Executive Officer of WBL Corporation. Mr Tan was previously Vice‐President (Customer Solutions Group) and Managing Director of Hewlett‐Packard South East Asia; a post he held from June 2002 when Hewlett‐Packard acquired Compaq.</p><p>He also served as the Vice‐President and Managing Director for the ASEAN region of Compaq Computer Asia between June 1999 and June 2002. He joined Compaq Computer in 1996 as the Chief Financial Officer for its Asia Pacific operations. Prior to joining Compaq, he spent 20 years in various multinational organisations in the audit and tax, oil services and IT industries, where he held a number of senior leadership positions in operations, sales, strategy and business development.</p><p>Mr Tan holds an Accountancy degree from the University of Singapore and is a non-practising Fellow of Certified Public Accountants (Singapore).</p>"
  },
  {
    "name": "Mr Winston Tan",
    "image": "../images/governing-winston-tan.jpg",
    "content": "<p><strong>Managing Director</strong><br>Corporate Brokers International Pte Ltd</p><p>Mr Winston Tan is currently the Managing Director of Winmark Investments Pte Ltd and Corporate Brokers International Pte Ltd, both of which are involved in angel and private equity investments.</p><p>He is also on the Board of Directors with several companies including Roxy-Pacific Holdings Limited, Plastoform Holdings Ltd, and Serrano Limited. He also serves on the Advisory Board of the Salvation Army and is a Member of Finance Committee of Wesley Methodist Church. </p><p>Mr Tan’s corporate experience includes 24 years in the banking industry. His last position was that of General Manager for the Singapore branch of Deutsche Bank AG and prior to that a Vice President in Citibank N.A. His previous appointments amongst others include being a Director of Singapore Technologies Engineering Ltd and Director of Ascendas Pte Ltd. </p><p>Mr Tan holds a Bachelor of Science in Physics from the former University of Singapore and was awarded as Outstanding Alumni (2005) by National University of Singapore.</p>"
  },
  {
    "name": "Mr George Thia",
    "image": "../images/governing-george-thia.jpg",
    "content": "<p><strong>Director</strong><br>Asiainc Pte Ltd</p><p>Mr George Thia is the Director of Asiainc Pte Ltd. He is currently a Trustee of the National Cancer Centre (NCC) Community Cancer Fund and the NCC Research Fund. He is also an Independent Director of CH Offshore Limited, a company listed on the Singapore Exchange.</p> <p>Mr Thia was Managing Director at Morgan Grenfell (Asia) Ltd, Merrill Lynch International Bank Ltd, Sun Hung Kai Securities Pte Ltd and Lum Chang Securities Pte Ltd. He was also an Executive Director and Partner of Kay Hian Pte Ltd (now UOB Kay Hian Securities Ltd). He has acted as a financial consultant to several private families and public listed companies, including Orchard Parade Holdings Ltd and Provision Suppliers Corporation Ltd. </p><p>Mr Thia has served as Independent Director and Chairman of the Audit Committee of several listed companies in Singapore and Malaysia. In June 2013, he retired as an Independent Commissioner and Chairman of the Audit Committee, Member of the Risk Management Committee and Capex & Budget Committee at PT Indosat tbk (listed on Bapepam Indonesia). He was Chairman of Mount Alvernia Hospital until January 2014. </p><p>He is known for his contributions to education and training, particularly in corporate finance, equity investments and the setting up of bourses.</p>"
  },
  {
    "name": "Mr Chia Wee Boon",
    "image": "../images/governing-chia-wee-boon.jpg",
    "content": "<p><strong>Co-opted Member </strong><br>SIM Governing Council</p><p><strong>Chief Executive Officer</strong><br>NCS Pte Ltd</p><p>Mr Chia Wee Boon is CEO of NCS and is responsible for leading the information technology business growth in business applications services and communications engineering for both enterprises and government agencies across the Asia Pacific region. He assumed this position on 1 July 2010. Mr Chia first joined NCS as the Chief Operating Officer in June 2009.</p><p>Prior to joining NCS, Wee Boon has over 30 years of vast global information communications technology experience. He had held various senior leadership positions in HP including Senior Vice President for Worldwide Alliance Sales in the Technology Solutions Group (Palo Alto), Senior Vice President for Sales in the Technology Solutions Group, Asia-Pacific & Japan (APJ), Senior Vice President of the APJ Customer Solutions Group, Vice President of the APJ Customer Support Business and Managing Director of HP Singapore and Southeast Asia.</p><p>Wee Boon had served on various national committees such as the Singapore Police Association for National Servicemen, the Civil Defence Association for National Servicemen and the National Institute of Education Council. He is currently a Steering Committee Member for both the Intelligent Transportation Society Singapore and the Infocomm Industry Productivity Roadmap, IDA. He also sits on the Scientific and Business Advisory Board for the Institute for Infocomm Research, IDA and the Advisory Board for Intuitif Technologies, Singapore.</p>"
  },
  {
    "name": "Ms Adeline Sum Wai Fun",
    "image": "../images/governing-adeline.jpg",
    "content": "<p><strong>Co-opted Member </strong><br>SIM Governing Council</p><p><strong>Deputy CEO (Strategic Alignment), NTUC Enterprise and Managing Director (Corporate Strategy)</strong><br>NTUC FairPrice</p><p>Ms Adeline Sum Wai Fun is Deputy CEO (Strategic Alignment), NTUC Enterprise and Managing Director (Corporate Strategy), NTUC FairPrice. She holds directorships in several NTUC social enterprises.</p><p>She has been a Non-Executive Director of ComfortDelGro Corporation Limited since 2007.</p><p>Adeline holds a Bachelor of Arts (History) from the National University of Singapore, a Master of Business Administration (Accountancy) from the Nanyang Technological University and a Master of Public Administration from Harvard University.</p>"
  },
  {
    "name": "Mr Ronald Tan Hee Huan",
    "image": "../images/governing-ronald-tan.jpg",
    "content": "<p><strong>Ex-Officio </strong><br>SIM Governing Council</p><p><strong>Executive Director</strong><br>Singapore Institute of Management</p><p>Mr Ronald Tan is the Executive Director of the Singapore Institute of Management (SIM). Mr Tan brought with him more than 25 years of varied experience from both the public and private sectors.</p><p>Prior to joining SIM, Mr Tan was Senior Vice President and Head of Group Human Resources at the United Overseas Bank Group. Before joining the Bank, Mr Tan held senior appointments in several government ministries under the Administrative Service. He served as a Combat Engineers Battalion Commander and was the Division Engineer of the Guards’ Division during his national service.</p><p>Mr Tan is also a Director of the NTUC First Campus Board of which he is a Member of the Establishment Committee and the Audit & Risk Committee. He also serves as a Member of the NKF Remuneration Committee and the HR Committee of Focus on the Family. Mr Tan was presented the Friend of Labour Award by the NTUC in 2016.</p><p>Mr Tan holds a Bachelor of Science in Mechanical Engineering and a Master of Business Administration.</p>"
  }
]
