[
  {
    "title": "dare2b<strong>MORE</strong>",
    "text": "Change is relentless and exponentially disruptive. Doing more of the same, even with our best, is a guarantee for extinction. Nothing less than the exceptional is needed to keep us relevant and thriving. At SIM, we continue to challenge our learners – and ourselves – to move from the ordinary to extraordinary. We empower them with the right knowledge, skills and perspectives to go beyond their own limits, to be more and do more to keep ahead of the curve. Internally, we are also fostering changes to help us deliver on our promise of learning that makes a real difference.",
    "image": "./images/home-banner-1.jpg",
    "id": "dare2bmore",
    "link": "",
    "color": "#171006"
  },
  {
    "title": "dare2b<strong>OPTIMISED</strong>",
    "text": "We see in all learners who come through our doors the potential to be the best they can be in whatever track they choose, whether for their learning or careers. Our range of certificated and continuing education and training programmes are curated to optimise learning and equip them with up-to-date market-relevant knowledge and skills so that they can tackle challenges and opportunities and perform at their peak at every stage of their career.",
    "image": "./images/home-banner-2.jpg",
    "id": "dare2boptimised",
    "link": "dare2boptimised",
    "color": "#2d1b21",
    "bannerclass": "dare2b-banner--optimised"
  },
  {
    "title": "dare2b<strong>EXCEPTIONAL</strong>",
    "text": "Success takes more than technical competence. Good grades may open doors but it is soft skills that help our students stand out. With a plethora of extracurricular activities, personal and career development programmes, our students step up to every opportunity to develop exceptional qualities in leadership, critical thinking, communications, teamwork and adaptability that will help them ace their careers and lives.",
    "image": "./images/home-banner-3.jpg",
    "id": "dare2bexceptional",
    "link": "dare2bexceptional",
    "color": "#06110a",
    "bannerclass": "dare2b-banner--exceptional"
  },
  {
    "title": "dare2b<strong>CHALLENGED</strong>",
    "text": "The ability to unlearn and relearn is an imperative in today’s exponentially changing world. Our thought leadership programmes expose learners to leading edge insights from prominent global thinkers and business leaders. Learning from the best and seeing from a fresh perspective challenges them to question the norm and inspires creative ideas that can break new ground and spark radical change.",
    "image": "./images/home-banner-4.jpg",
    "id": "dare2bchallenged",
    "__class": "is-reversed",
    "link": "dare2bchallenged",
    "color": "#151e29",
    "bannerclass": "dare2b-banner--challenged is-reversed"
  },
  {
    "title": "dare2b<strong>COUNTED</strong>",
    "text": "Often it is not just what we know but who we know that matters. At the heart of our inclusive network of learners are our members, students, alumni, partners, trainers, lecturers and staff. What gives this community vibrancy and value is the fact that everyone’s voice counts. The network is enriched when community members give feedback, and share and build on ideas to make a difference.",
    "image": "./images/home-banner-5.jpg",
    "id": "dare2bcounted",
    "link": "dare2bcounted",
    "color": "#170500",
    "bannerclass": "dare2b-banner--counted"
  }
]
