[
  {
    "name": "Mr Tan Choon Seng",
    "subtitle": "",
    "image": "../images/governing-tan-choon-seng.jpg",
    "content": "<p><strong>Chairman</strong><br>SIM AEC Pte Ltd Board of Directors<br>(until 20 Jun 2018)</p><p><strong>Advisor</strong><br>Truscott Group</p><p>Mr Tan Choon Seng is Chairman of Truscott Group, a private investment company. He is an active angel investor and has co-founded Indiverein, Link2ventures and Aleko Investment Pte Ltd.</p><p>He holds directorships in Fundedbyme Sweden, Fundedbyme Asia Pacific Ltd and Noa Potions AB, Sweden. He is a Director of Kuangchen Pte Ltd, Sparrow Capital Pte Ltd and Nihon Connexion Pte Ltd.</p><p>He was formerly the Group Chief Executive Officer of WBL Corporation. Mr Tan was previously Vice‐President (Customer Solutions Group) and Managing Director of Hewlett‐Packard South East Asia; a post he held from June 2002 when Hewlett‐Packard acquired Compaq.</p><p>He also served as the Vice‐President and Managing Director for the ASEAN region of Compaq Computer Asia between June 1999 and June 2002. He joined Compaq Computer in 1996 as the Chief Financial Officer for its Asia Pacific operations. Prior to joining Compaq, he spent 20 years in various multinational organisations in the audit and tax, oil services and IT industries, where he held a number of senior leadership positions in operations, sales, strategy and business development.</p><p>Mr Tan holds an Accountancy degree from the University of Singapore and is a non-practising Fellow of Certified Public Accountants (Singapore).</p>"
  },
  {
    "name": "Mr Patrick Fang",
    "image": "../images/governing-patrick-fang.jpg",
    "content": "<span class='smaller date'>(until 20 Jun 2018)</span><p><strong>Managing Director</strong><br>PFang & Associates Pte Ltd</p><p>Mr Patrick Fang is currently the Managing Director of PFang & Associates Pte Ltd and he focuses on senior executive searches and assessment assignments for both privately and publicly listed firms including local conglomerates in Singapore and the Asian region. Mr Fang has specific expertise in the technology, industrial and financial services (insurance) sectors.</p><p>Prior to PFang & Associates, Mr Fang spent 16 years with Russell Reynolds Associates where he has held roles as the Managing Director and co-Office Manager for Singapore. He was also a leader in the technology and digital transformation practice, and has worked closely with telecommunications and financial services clients.</p><p>Mr Fang was previously with IMPAC, a US-based management consulting firm, where he held the position of Vice President, Operations, with responsibilities for multiple global regions. He also spent eight years with Motorola overseeing its multimedia and wireless data product activities.</p><p>He received his Bachelor of Science (Honours) in Mechanical Engineering from Plymouth University and Master of Arts (Distinction) in Business Analysis from the University of Lancaster.</p>"
  },
  {
    "name": "Mr Jen Kwong Hwa",
    "image": "../images/governing-jen-kwong-hwa.jpg",
    "content": "<span class='smaller date'>(until 20 Jun 2018)</span><p><strong>Chairman</strong><br>GridComm Pte Ltd</p><p>Mr Jen Kwong Hwa is Chairman at GridComm Pte Ltd.</p><p>Prior to this, he was Managing Director of Micron Semiconductors in Singapore and an engineer by training. He started his career in Texas Instruments in 1979 and joined Micron in 1998 with Micron's acquisition of Texas Instruments’ memory business.</p><p>Mr Jen has extensive experience in the semiconductor industry and has been involved in shaping national strategic initiatives through his involvement in SEMI, SSIA and membership in various statutory boards like Energy Market Authority, Jurong Town Council and Economic Strategies Committee.</p><p>He is currently a Board Member of LIME Learning Systems Pte Ltd and Connected Health.</p>"
  },
  {
    "name": "Mr Ronald Tan Hee Huan",
    "image": "../images/governing-ronald-tan.jpg",
    "content": "<p><strong>Executive Director</strong><br>Singapore Institute of Management</p><p>Mr Ronald Tan is the Executive Director of the Singapore Institute of Management (SIM). Mr Tan brought with him more than 25 years of varied experience from both the public and private sectors.</p><p>Prior to joining SIM, Mr Tan was Senior Vice President and Head of Group Human Resources at the United Overseas Bank Group. Before joining the Bank, Mr Tan held senior appointments in several government ministries under the Administrative Service. He served as a Combat Engineers Battalion Commander and was the Division Engineer of the Guards’ Division during his national service.</p><p>Mr Tan is also a Director of the NTUC First Campus Board of which he is a Member of the Establishment Committee and the Audit & Risk Committee. He also serves as a Member of the NKF Remuneration Committee and the HR Committee of Focus on the Family. Mr Tan was presented the Friend of Labour Award by the NTUC in 2016.</p><p>Mr Tan holds a Bachelor of Science in Mechanical Engineering and a Master of Business Administration.</p>"
  }
]
