[
  {
    "name": "Mr Tan Soo Jin",
    "image": "../images/governing-tan-soo-jin.jpg",
    "content": "<p><strong>Chairman </strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors<br><span class='smaller'>(until 30 June 2018)</span></p><p><strong>Advisor </strong><br>Gattie-Tan Soo Jin Management Consultants Pte Ltd</p><p>Mr Tan Soo Jin, BEc (Monash) MBA (UNSW), is the Advisor of Gattie-Tan Soo Jin Management Consultants Pte Ltd (GTSJ) for leadership consulting. He founded Tan Soo Jin Consultants in Singapore in 1984 which later became GTSJ in 1992, having previously been with Egon Zehnder, Korn Ferry and Amrop. He also worked with Smith & Nephew, University of Singapore and Shell Australia.</p><p>Mr Tan has been in executive search since 1977 with particular expertise in the financial services, consumer & retail and education sectors.</p><p>He was the Chairman of SIM Governing Council as well as Singapore Institute of Management Holdings Pte Ltd Board of Directors for the terms 2014-2018.</p><p>He is a Member of the NUS Business School Management Advisory Board and in 2012, he was appointed and is currently serving as an Executive-In-Residence with the NUS Business School. He formerly sat on the National Library Board, chairing its Ethics and Establishment Committees. He was also formerly on the Temasek Polytechnic Business Advisory Committee and a former Member of the Centre for Innovation and Enterprise's (CIE) Advisory Panel at Republic Polytechnic.</p><p>He was named in Bloomberg BusinessWeek’s 100 Most Influential Headhunters in the world in 2008.</p>"
  },
  {
    "name": "Professor Cham Tao Soon",
    "image": "../images/governing-cham-tao-soon.jpg",
    "content": "<p><strong>Member</strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors<br><span class='smaller'>(until 2 July 2018)</span></p><p><strong>President Emeritus</strong><br>Nanyang Technological University</p><p>Professor Cham Tao Soon was trained as a civil engineer at the University of Malaya in Kuala Lumpur. Thereafter he left for University of Cambridge for a PhD in Aerodynamics from 1965 to 1968. On return from Cambridge, he taught engineering at the University of Singapore and became the Dean of Engineering in 1978. He was asked by the then Minister of Education Dr Tony Tan to start Nanyang Technological Institute (NTI) in 1981 and then Nanyang Technological University (NTU) in 1991. He retired from NTU in 2002. His next educational initiative was to start the SIM University in 2005 and he retired as its Chancellor and Chairman in 2014.</p><p>Professor Cham has made his contributions to statutory bodies like Land Transport Authority, Jurong Town Corporation, Construction Industry Development Board, Science Council and National Science and Technology Board; and non-profit organisations like Singapore Symphony Orchestra, Singapore Quality Award and Tan Chin Tuan Foundation. He was a Member of Council of Presidential Advisors from 2004 to 2010. Over the years he was Independent Director of SMRT LTD, WBL Corporation Ltd, United Overseas Bank and Singapore Press Holdings.</p><p>Currently he is the Chairman of NSL Ltd, Soup Restaurant Group Ltd and Singapore Rail Academy.</p>"
  },
  {
    "name": "Professor Hsieh Tsun-yan",
    "image": "../images/governing-hsieh-tsun-yan.jpg",
    "content": "<p><strong>Member</strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors<br><span class='smaller'>(until 30 June 2018)</span></p><p><strong>Chairman and Lead Counsellor</strong><br>LinHart Group</p><p>Professor Hsieh Tsun-yan is the Chairman and Lead Counsellor of LinHart Group, a leadership services firm specialising in advising boards and counselling CEOs globally on succession and top leadership effectiveness. He is an Independent Director of Manulife Financial and Singapore Airlines and served on the Boards of Bharti Airtel and Sony. He is also a Provost Chair Professor (Practice) at the NUS Business School and the Lee Kuan Yew School of Public Policy. He also serves as a special advisor to companies such as Cue Ball (media and technologies) and AppDirect (cloud services).</p><p>In a career spanning 30 years with McKinsey, he took on leadership positions including Chairman of Professional Development Committee, Managing Director, Canada and ASEAN practices, Chairman of Asia Client Committee, Global leader of the Organisation and Leadership practice, and the Directors Committee.</p><p>His community service includes Board roles current and past with the Duke-NUS Medical School, the Singapore International Foundation, the National University of Singapore Business School, the Institute of Policy Studies, the Singapore Symphony Orchestra, Covenant House Canada and the University Health Network Foundation in Toronto.</p><p>Professor Hsieh is a Harvard MBA who won double gold medals reading Mechanical Engineering at the University of Alberta as a President and Colombo Plan Scholar.</p>"
  },
  {
    "name": "Dr Lee Kwok Cheong",
    "image": "../images/governing-lee-kwok-cheong.jpg",
    "content": "<p><strong>Member</strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors<br><span class='smaller'>(until 16 May 2018)</span></p><p><strong>Chief Executive Officer</strong><br>Singapore Institute of Management Holdings Pte Ltd</p><p>Dr Lee Kwok Cheong is Chief Executive Officer of Singapore Institute of Management Holdings Pte Ltd. Previously, he was Founding Group Chief Executive Officer of NCS Pte Ltd, a subsidiary of the SingTel Group.</p><p>Dr Lee received The Public Service Medal in 2010 and Public Service Star in 2016. He was conferred the IT Person of the year Award in 2000, Honorary Fellow in 2008 and Hall of Fame Award in 2011 by the Singapore Computer Society, the H.E.A.L.T.H. Leader Excellence Award from the Health Promotion Board in 2004, and the Special Recognition Award given by the Ministry of Information, Communications and the Arts in 2006.</p><p>Dr Lee spearheaded the establishment of the Singapore Association for Private Education and is the Founding President. He currently sits on the Board of Nera Telecommunications Ltd and is also a Member of SkillsFuture Singapore’s Essential Domestic Services Sub-Committee overseeing the Education and Healthcare sectors’ Industry Transformation Maps.</p><p>Dr Lee sat on the Steering Committee of the Infocomm Media Masterplan under MCI and chaired one of its Working Committees – Manpower & Talent Development. He previously served on the Boards of Singapore Polytechnic, Nanyang Polytechnic, the Institute of Technical Education (ITE), ITE Holdings Pte Ltd and Inland Revenue Authority of Singapore. Dr Lee was a Member of the Committee to Review Upgrading Opportunities at Degree Level and chaired the Policy Study Workgroup on Education and Human Capital Excellence. He also served on the National Integration Council’s Working Group for Schools.</p><p>Dr Lee graduated from Massachusetts Institute of Technology and the University of California at Berkeley. In 2014 and 2016, he was awarded a Doctor of Business honoris causa by the RMIT University and a Doctor of Science honoris causa by the University of London respectively.</p>"
  },
  {
    "name": "Mr Ong Boon Hwee",
    "image": "../images/governing-ong-boon-hwee.jpg",
    "content": "<p><strong>Member</strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors<br><span class='smaller'>(until 2 July 2018)</span></p><p><strong>Chief Executive Officer</strong><br>Stewardship Asia Centre</p><p>Mr Ong Boon Hwee is the Chief Executive Officer of the Stewardship Asia Centre.</p><p>Prior to his current appointment, Mr Ong has a diverse career where he served in the civil service, in corporations and also in entrepreneurship start-ups.</p><p>In his earlier military career, Brigadier General Ong held various key command and staff positions in the Singapore Armed Forces and the Ministry of Defence. He left the civil service to move into a corporate career in management and business. Mr Ong had previously served as the Managing Director for Strategic Relations in Temasek Holdings and also held a concurrent position as the Chief Executive Officer of Temasek Management Services. He then moved on to take on the role of Chief Operating Officer of Singapore Power, and was responsible for all the business units in Singapore. Mr Ong serves as a Director on the Boards of a number of companies and non-profit organisations.</p>"
  },
  {
    "name": "Mr Ronald Tan Hee Huan",
    "image": "../images/governing-ronald-tan.jpg",
    "content": "<p><strong>Member</strong><br>Singapore Institute of Management Holdings Pte Ltd Board of Directors</p><p><strong>Executive Director</strong><br>Singapore Institute of Management</p><p>Mr Ronald Tan is the Executive Director of the Singapore Institute of Management (SIM). Mr Tan brought with him more than 25 years of varied experience from both the public and private sectors.</p><p>Prior to joining SIM, Mr Tan was Senior Vice President and Head of Group Human Resources at the United Overseas Bank Group. Before joining the Bank, Mr Tan held senior appointments in several government ministries under the Administrative Service. He served as a Combat Engineers Battalion Commander and was the Division Engineer of the Guards’ Division during his national service.</p><p>Mr Tan is also a Director of the NTUC First Campus Board of which he is a Member of the Establishment Committee and the Audit & Risk Committee. He also serves as a Member of the NKF Remuneration Committee and the HR Committee of Focus on the Family. Mr Tan was presented the Friend of Labour Award by the NTUC in 2016.</p><p>Mr Tan holds a Bachelor of Science in Mechanical Engineering and a Master of Business Administration.</p>"
  }
]
